mariopartyrd/marioparty4/src/REL/m408Dll/stage.c
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                temp_r31->time = (s32)(360.0 * ((1.0 / 65536.0) * (float)fn_1_11670()));
                temp_r31->pos.x = temp_r31->pos.y = temp_r31->pos.z = 0;
                temp_r26 = (temp_f30 * temp_r28) + (int)((temp_f30 * 0.5f) * ((1.0 / 32768.0) * (float)(fn_1_11670() - 32768)));
                temp_r31->speedDecay = temp_r26;
                temp_r31->zRot = (M_PI * (temp_r26 + 90.0f)) / 180.0;
                temp_r31->vel.x = sind(temp_r26);
                temp_r31->vel.y = 0;
                temp_r31->vel.z = cosd(temp_r26);
                temp_f31 = temp_r29->pos.y + ((0.25f * temp_r29->pos.y) * ((1.0 / 65536.0) * (float)fn_1_11670()));
                temp_r31->accel.x = temp_f31 * temp_r31->vel.x;
                temp_r31->accel.y = 120.0 * ((1.0 / 32768.0) * (float)(fn_1_11670() - 32768));
                temp_r31->accel.z = temp_f31 * temp_r31->vel.z;
                temp_r31->colorIdx = temp_r31->scale = (0.01 * (frand() % 2000)) + 160;
                if (particle->blendMode == 1) {
                    temp_r27 = frand() & 0x2F;
                    temp_r31->color.r = temp_r27 + 32;
                    temp_r31->color.g = temp_r27 + 32;
                    temp_r31->color.b = 64 + temp_r27 + ((int)(((46 - temp_r27) * ((1.0 / 65536.0) * (float)fn_1_11670()))));
                    temp_r31->color.a = (frand() & 0x2F) + 32;
                }
                else {
                    temp_r27 = frand() & 0x2F;
                    temp_r31->color.r = temp_r27 + 208;
                    temp_r31->color.g = temp_r27 + 208;
                    temp_r31->color.a = (frand() & 0x4F) + 176;
                }
            }
            temp_r29->emitCnt++;

        case 1:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                temp_r31->time += 4;
                if (temp_r31->time >= 360) {
                    temp_r31->time -= 360;
                }
                temp_r31->pos.x = temp_r31->accel.x;
                temp_r31->pos.y = temp_r31->accel.y;
                temp_r31->pos.z = temp_r31->accel.z;
                temp_r31->zRot = M_PI * (90 + (temp_r31->speedDecay + temp_r29->pos.z)) / 180;
                temp_r31->scale = temp_r31->colorIdx * ((0.1f * sind(temp_r31->time)) + 1.0);
            }
            break;
    }
    DCFlushRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
}

void fn_1_E9B4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f30;
    float temp_f31;
    HU3DPARTICLEDATA *temp_r31;
    HU3DPARTICLE *temp_r30;
    s32 temp_r28;
    s16 temp_r27;
    s32 temp_r26;
    temp_r30 = particle->work;
    switch (temp_r30->emitCnt) {
        case 0:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                temp_r31->time = fn_1_11670() % 360;
                temp_r31->pos.x = temp_r31->pos.y = temp_r31->pos.z = 0;
                temp_r27 = fn_1_11670() % 360;
                temp_r31->speedDecay = temp_r27;
                temp_r31->vel.x = sind(temp_r27);
                temp_r31->vel.y = 0;
                temp_r31->vel.z = cosd(temp_r27);
                temp_f31 = temp_r30->pos.x + (0.01 * ((30.0f * temp_r30->pos.x) * ((1.0 / 65536.0) * (float)fn_1_11670())));
                temp_f30 = (0.15f + (0.3f * ((1.0 / 65536.0) * (float)fn_1_11670())));
                temp_r31->accel.x = temp_f31 * temp_r31->vel.x;
                temp_r31->accel.y = 50 * ((1.0 / 32768.0) * (float)(fn_1_11670() - 32768));
                temp_r31->accel.z = temp_f31 * temp_r31->vel.z * temp_f30;
                temp_r31->colorIdx = temp_r31->scale
                    = temp_r30->pos.x + (0.01 * ((50.0f * temp_r30->pos.x) * ((1.0 / 65536.0) * (float)fn_1_11670())));
                temp_r26 = frand() & 0x7F;
                temp_r31->color.r = temp_r26 + 64;
                temp_r31->color.g = temp_r26 + 64;
                temp_f31 -= temp_r30->pos.x;
                temp_r31->color.a
                    = 32 + (int)((48.0f * temp_f31) / (0.2f * temp_r30->pos.x)) + (int)(32 * ((1.0 / 65536.0) * (float)fn_1_11670()));
            }
            temp_r30->emitCnt++;

        case 1:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                temp_r31->time += 2;
                if (temp_r31->time >= 360) {
                    temp_r31->time -= 360;
                }
                temp_r31->pos.x = temp_r31->accel.x;
                temp_r31->pos.y = temp_r31->accel.y;
                temp_r31->pos.z = temp_r31->accel.z;
                temp_r31->scale = temp_r31->colorIdx * ((0.1f * sind(temp_r31->time)) + 1.0);
            }
            break;
    }
    DCFlushRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
}

void fn_1_EEF8(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    HU3DPARTICLEDATA *temp_r31;
    HU3DPARTICLE *temp_r29;
    s32 temp_r28;
    u8 temp_r27;
    temp_r29 = particle->work;
    switch (temp_r29->emitCnt) {
        case 0:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                temp_r31->pos.x = temp_r31->pos.y = temp_r31->pos.z = 0;
                temp_r31->color.r = temp_r31->color.g = temp_r31->color.b = temp_r31->color.a = 255;
                temp_r31->scale = temp_r29->pos.x;
            }
            temp_r29->emitCnt++;
            break;

        case 1:
            if (temp_r29->pos.y < 0.0f) {
                break;
            }
            temp_f31 = 0.1f + temp_r29->pos.y;
            temp_f31 = 1.2f * (temp_f31 * temp_f31);
            if (temp_f31 > 1.0f) {
                temp_f31 = 1.0f;
            }
            temp_r27 = 255 * temp_f31;
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                temp_r31->color.a = temp_r27;
            }
            break;
    }
    DCFlushRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
}

void fn_1_F06C(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    HU3DPARTICLEDATA *temp_r31;
    HU3DPARTICLE *temp_r29;
    s32 temp_r28;
    s16 temp_r27;
    temp_r27 = 0;
    temp_r29 = particle->work;
    switch (temp_r29->emitCnt) {
        case 0:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                temp_r31->time = temp_r31->parManId = 0;
            }
            temp_r29->emitCnt++;
            break;

        case 1:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                if (temp_r31->time) {
                    temp_r31->time--;
                    continue;
                }
                if (temp_r31->parManId == 0) {
                    temp_f31 = 360.0f * ((1.0 / 65536.0) * (float)fn_1_11670());
                    temp_r31->pos.x = 10.0 * (50.0 + (250.0 * ((1.0 / 65536.0) * (float)fn_1_11670()))) * sind(temp_f31);
                    temp_r31->pos.y = 0;
                    temp_r31->pos.z = 10.0 * (50.0 + (250.0 * ((1.0 / 65536.0) * (float)fn_1_11670()))) * cosd(temp_f31);
                    temp_r31->zRot = (M_PI * (temp_f31 - 90.0f)) / 180;
                    temp_r31->color.r = temp_r31->color.g = temp_r31->color.b = temp_r31->color.a = 192;
                    temp_r31->color.b = 160;
                    temp_r31->scale = 0;
                    temp_r31->time = (s32)(90.0 * ((1.0 / 65536.0) * (float)fn_1_11670()));
                    temp_r31->parManId = 60;
                }
                temp_r31->color.a = 248 * sind(temp_r31->parManId * 3);
                temp_r31->scale = temp_r29->pos.x * (60 - temp_r31->parManId);
                temp_r31->parManId--;
            }
            if (particle->maxCnt == temp_r27) {
                Hu3DModelAttrReset(temp_r29->dataCnt, HU3D_ATTR_PARTICLE_KILL);
                Hu3DModelKill(temp_r29->dataCnt);
                return;
            }
            break;
    }
    DCFlushRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
}

