mariopartyrd/marioparty4/src/REL/m408Dll/stage.c
WorkF4B0 *fn_1_F4B0(s16 arg0, s16 arg1)
{
    WorkF4B0 *temp_r31;
    s32 temp_r30;
    HU3DMODEL *temp_r29;
    temp_r29 = &Hu3DData[arg0];
    temp_r31 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(WorkF4B0), MEMORY_DEFAULT_NUM);
    temp_r29->hookData = temp_r31;
    temp_r31->unk0 = arg0;
    temp_r31->unk2 = arg1;
    temp_r31->unk4 = NULL;
    temp_r31->unk8 = NULL;
    for (temp_r30 = 0; temp_r30 < 32; temp_r30++) {
        temp_r31->unk10[temp_r30] = 0;
    }
    return temp_r31;
}

void fn_1_F564(s16 arg0)
{
    float temp_f31;
    WorkF4B0 *temp_r31;
    s32 temp_r30;
    HSFOBJECT *temp_r29;
    s32 temp_r28;
    HU3DMODEL *temp_r27;
    temp_r27 = &Hu3DData[arg0];
    temp_r29 = temp_r27->hsf->root;
    temp_r31 = temp_r27->hookData;
    if (temp_r31->unk8 == NULL) {
        temp_r31->unk8 = HuMemDirectMallocNum(HEAP_SYSTEM, temp_r29->mesh.st->count * sizeof(HuVec2f), MEMORY_DEFAULT_NUM);
        temp_r31->unkC = HuMemDirectMallocNum(HEAP_SYSTEM, temp_r29->mesh.st->count, MEMORY_DEFAULT_NUM);
        for (temp_r30 = 0; temp_r30 < temp_r29->mesh.st->count; temp_r30++) {
            temp_r31->unk8[temp_r30].x = ((HuVec2f *)(temp_r29->mesh.st->data))[temp_r30].x;
            temp_r31->unk8[temp_r30].y = ((HuVec2f *)(temp_r29->mesh.st->data))[temp_r30].y;
        }
    }
    temp_r31->unk10_f[0] += 2.0f;
    for (temp_r30 = 0; temp_r30 < temp_r29->mesh.st->count; temp_r30++) {
        temp_r31->unkC[temp_r30] = 0;
    }
    for (temp_r30 = 0; temp_r30 < temp_r29->mesh.st->count; temp_r30++) {
        if (temp_r31->unkC[temp_r30]) {
            continue;
        }
        temp_r31->unkC[temp_r30]++;
        temp_f31 = temp_r31->unk10_f[0] + (60.0f * temp_r30);
        ((HuVec2f *)(temp_r29->mesh.st->data))[temp_r30].x = temp_r31->unk8[temp_r30].x + (0.005f * sind(temp_f31));
        ((HuVec2f *)(temp_r29->mesh.st->data))[temp_r30].y = temp_r31->unk8[temp_r30].y + (0.005f * cosd(temp_f31));
        for (temp_r28 = temp_r30; temp_r28 < temp_r29->mesh.st->count; temp_r28++) {
            if (temp_r31->unkC[temp_r28]) {
                continue;
            }
            if (temp_r31->unk8[temp_r30].x != temp_r31->unk8[temp_r28].x || temp_r31->unk8[temp_r30].y != temp_r31->unk8[temp_r28].y) {
                continue;
            }
            temp_r31->unkC[temp_r28]++;
            ((HuVec2f *)(temp_r29->mesh.st->data))[temp_r28].x = ((HuVec2f *)(temp_r29->mesh.st->data))[temp_r30].x;
            ((HuVec2f *)(temp_r29->mesh.st->data))[temp_r28].y = ((HuVec2f *)(temp_r29->mesh.st->data))[temp_r30].y;
        }
    }
}

typedef struct unk_fn_10484 {
    HU3DMODEL *unk0;
    HSFOBJECT *unk4;
    s32 unk8;
    Mtx unkC;
    float unk3C[2];

} UnkFn10484;

void fn_1_10484(UnkFn10484 *arg0, HSFFACE *arg1, HSFDRAWDATA *arg2, GXColor *arg3);

void fn_1_F8A0(HU3DMODEL *arg0, Mtx arg1)
{
    WorkF4B0 *temp_r31;
    GXColor *temp_r30;
    s16 temp_r29;
    s32 temp_r28;
    HSFBUFFER *temp_r27;
    HSFFACE *temp_r26;

    UnkFn10484 spA0;
    Mtx sp70;
    Mtx sp40;
    Mtx sp10;
    s16 spC = 0;
    temp_r31 = arg0->hookData;
    spA0.unk0 = &Hu3DData[temp_r31->unk2];
    spA0.unk4 = spA0.unk0->hsf->root;
    MTXCopy(arg1, spA0.unkC);
    lbl_1_bss_128[0] = spA0.unk4->constData;
    lbl_1_bss_120[0] = lbl_1_bss_128[0]->dlBuf;
    lbl_1_bss_11C = lbl_1_bss_128[0]->drawData;
    GXLoadPosMtxImm(spA0.unkC, GX_PNMTX0);
    MTXInverse(spA0.unkC, sp70);
    MTXTranspose(sp70, sp40);
    GXLoadNrmMtxImm(sp40, GX_PNMTX0);
    if (Hu3DShadowF && (lbl_1_bss_128[0]->attr & 0x8)) {
        MTXConcat(sp10, spA0.unkC, sp40);
        MTXConcat(Hu3DShadowData.projMtx, Hu3DShadowData.lookAtMtx, sp70);
        MTXConcat(sp70, sp40, sp40);
        GXLoadTexMtxImm(sp40, GX_TEXMTX9, GX_MTX3x4);
    }
    GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_ONE, GX_LO_NOOP);
    if (temp_r31->unk4 == NULL) {
        temp_r31->unk4 = HuMemDirectMallocNum(HEAP_SYSTEM, spA0.unk4->mesh.color->count * sizeof(GXColor), MEMORY_DEFAULT_NUM);
        for (temp_r29 = 0; temp_r29 < spA0.unk4->mesh.color->count; temp_r29++) {
            temp_r30 = &temp_r31->unk4[temp_r29];
            temp_r30->r = temp_r31->unk10[0];
            temp_r30->g = temp_r31->unk10[1];
            temp_r30->b = temp_r31->unk10[2];
            if (((GXColor *)(spA0.unk4->mesh.color->data))[temp_r29].a == 255) {
                temp_r30->a = temp_r31->unk10[3];
            }
            else {
                temp_r30->a = ((GXColor *)(spA0.unk4->mesh.color->data))[temp_r29].a;
            }
        }
    }
    temp_r27 = spA0.unk4->mesh.face;
    temp_r26 = temp_r27->data;
    temp_r28 = 0;
    for (temp_r29 = 0; temp_r29 < temp_r27->count;) {
        fn_1_10484(&spA0, temp_r26, &lbl_1_bss_11C[temp_r28], temp_r31->unk4);
        temp_r28++;
        temp_r29 += lbl_1_bss_11C[temp_r28 - 1].polyCnt;
        temp_r26 += lbl_1_bss_11C[temp_r28 - 1].polyCnt;
    }
}

void fn_1_FB98(HU3DMODEL *arg0, Mtx arg1)
{
    WorkF4B0 *temp_r31;
    s16 temp_r30;
    s16 temp_r29;
    s16 temp_r28;
    GXColor *temp_r27;
    s32 temp_r26;
    HSFBUFFER *temp_r25;
    HSFFACE *temp_r24;
    s32 temp_r23;
    void *temp_r22;

    UnkFn10484 sp120;
    Mtx spF0;
    Mtx spC0;
    Mtx sp90;
    float sp50[2][8];
    float sp10[2][8];
    s16 spC = 0;
    temp_r31 = arg0->hookData;
    sp120.unk0 = &Hu3DData[temp_r31->unk2];
    sp120.unk4 = sp120.unk0->hsf->root;
    MTXCopy(arg1, sp120.unkC);
    lbl_1_bss_128[0] = sp120.unk4->constData;
    lbl_1_bss_120[0] = lbl_1_bss_128[0]->dlBuf;
    lbl_1_bss_11C = lbl_1_bss_128[0]->drawData;
    GXLoadPosMtxImm(sp120.unkC, GX_PNMTX0);
    MTXInverse(sp120.unkC, spF0);
    MTXTranspose(spF0, spC0);
    GXLoadNrmMtxImm(spC0, GX_PNMTX0);
    if (Hu3DShadowF && (lbl_1_bss_128[0]->attr & 0x8)) {
        MTXConcat(sp90, sp120.unkC, spC0);
        MTXConcat(Hu3DShadowData.projMtx, Hu3DShadowData.lookAtMtx, spF0);
        MTXConcat(spF0, spC0, spC0);
        GXLoadTexMtxImm(spC0, GX_TEXMTX9, GX_MTX3x4);
    }
    GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_ONE, GX_LO_NOOP);
    if (temp_r31->unk4 == NULL) {
        temp_r31->unk4 = HuMemDirectMallocNum(HEAP_SYSTEM, sp120.unk4->mesh.color->count * sizeof(GXColor), MEMORY_DEFAULT_NUM);
        for (temp_r30 = 0; temp_r30 < sp120.unk4->mesh.color->count; temp_r30++) {
            temp_r27 = &temp_r31->unk4[temp_r30];
            temp_r27->r = temp_r31->unk10[0];
            temp_r27->g = temp_r31->unk10[1];
            temp_r27->b = temp_r31->unk10[2];
            temp_r27->a = temp_r31->unk10[3];
        }
    }
    if (temp_r31->unk8 == NULL) {
        temp_r31->unk8 = HuMemDirectMallocNum(HEAP_SYSTEM, sp120.unk4->mesh.st->count * sizeof(HuVec2f), MEMORY_DEFAULT_NUM);
        temp_r31->unkC = HuMemDirectMallocNum(HEAP_SYSTEM, sp120.unk4->mesh.st->count, MEMORY_DEFAULT_NUM);
        for (temp_r30 = 0; temp_r30 < sp120.unk4->mesh.st->count; temp_r30++) {
            temp_r31->unk8[temp_r30].x = ((HuVec2f *)(sp120.unk4->mesh.st->data))[temp_r30].x;
            temp_r31->unk8[temp_r30].y = ((HuVec2f *)(sp120.unk4->mesh.st->data))[temp_r30].y;
        }
    }
    temp_r31->unk10_f[15] += 0.5f;
    for (temp_r30 = 0; temp_r30 < 8; temp_r30++) {
        float temp_f31 = temp_r31->unk10_f[15] + (40.0f * temp_r30);
        sp50[0][temp_r30] = sind(temp_f31);
        sp10[0][temp_r30] = cosd(temp_f31);
    }
    for (temp_r30 = 0; temp_r30 < sp120.unk4->mesh.st->count; temp_r30++) {
        temp_r31->unkC[temp_r30] = 0;
    }
    for (temp_r30 = 0, temp_r29 = 0; temp_r30 < sp120.unk4->mesh.st->count; temp_r30++, temp_r29++) {
        if (temp_r31->unkC[temp_r30]) {
            continue;
        }
        temp_r31->unkC[temp_r30]++;
        if (temp_r31->unk10[4]) {
            temp_r31->unk8[temp_r30].x = (1.5f * ((HuVec2f *)(sp120.unk4->mesh.st->data))[temp_r30].x) + (0.04f * sp50[0][temp_r29 & 0x7]);
            temp_r31->unk8[temp_r30].y = (2.0f * ((HuVec2f *)(sp120.unk4->mesh.st->data))[temp_r30].y) + (0.04f * sp10[0][temp_r29 & 0x7]);
        }
        else {
            temp_r31->unk8[temp_r30].x = (1.25f * ((HuVec2f *)(sp120.unk4->mesh.st->data))[temp_r30].x) + (0.04f * sp50[0][temp_r29 & 0x7]);
            temp_r31->unk8[temp_r30].y = (1.75f * ((HuVec2f *)(sp120.unk4->mesh.st->data))[temp_r30].y) + (0.04f * sp10[0][temp_r29 & 0x7]);
        }
        temp_r23 = temp_r31->unk10[3] + ((0.8f * temp_r31->unk10[3]) * sind((3.0f * temp_r31->unk10_f[15]) + (120.0f * temp_r29)));
        temp_r31->unk4[temp_r30].a = temp_r23;
        for (temp_r28 = temp_r30; temp_r28 < sp120.unk4->mesh.st->count; temp_r28++) {
            temp_r29++;
            if (temp_r31->unkC[temp_r28]) {
                continue;
            }
            if (((HuVec2f *)(sp120.unk4->mesh.st->data))[temp_r30].x != ((HuVec2f *)(sp120.unk4->mesh.st->data))[temp_r28].x
                || ((HuVec2f *)(sp120.unk4->mesh.st->data))[temp_r30].y != ((HuVec2f *)(sp120.unk4->mesh.st->data))[temp_r28].y) {
                continue;
            }
            temp_r31->unkC[temp_r28]++;
            temp_r31->unk8[temp_r28].x = temp_r31->unk8[temp_r30].x;
            temp_r31->unk8[temp_r28].y = temp_r31->unk8[temp_r30].y;
            temp_r31->unk4[temp_r28].a = temp_r23;
            temp_r29--;
        }
    }
    temp_r22 = sp120.unk4->mesh.st->data;
    sp120.unk4->mesh.st->data = temp_r31->unk8;
    temp_r25 = sp120.unk4->mesh.face;
    temp_r24 = temp_r25->data;
    temp_r26 = 0;
    for (temp_r30 = 0; temp_r30 < temp_r25->count;) {
        fn_1_10484(&sp120, temp_r24, &lbl_1_bss_11C[temp_r26], temp_r31->unk4);
        temp_r26++;
        temp_r30 += lbl_1_bss_11C[temp_r26 - 1].polyCnt;
        temp_r24 += lbl_1_bss_11C[temp_r26 - 1].polyCnt;
    }
    sp120.unk4->mesh.st->data = temp_r22;
}

